# -*- coding: utf-8 -*-
NEG_VIEWS_KEYWORDS = ['下称','持股','公告称','先后发言','发言人','发言','会上','发了言','习近平指出','习近平强调','习近平在讲话中','习近平曾经说']
NEG_NR = ['李克强','习近平','彭华岗','关键时','危为机','常观']
VIEWS_KEYWORDS = ["表示","认为","称","指出","说","强调","看来","介绍","点评","发表","提到","预计","体现","意味","来看","观点","我们","事实上","专家","而言","提出","分析"]
SPECIAL_IDENTITIES = ['证券部人士', '投行人士', '投行业内人士', '创投界人士', '市场分析人士','私募分析人士','专家认为','资深专家','从业人士','资深专家及从业人士','业内人士']
SECURITIES = []


def f(p):
    c1 = 0
    for word in VIEWS_KEYWORDS:
        if word in p:
            print(word)
            neg = 0
            for word1 in NEG_VIEWS_KEYWORDS:
                if word1 in p:
                    neg +=1
                    break
            if neg == 0:
                c1+=1
                break
            
    print(c1)
    
    
p = '在用户和商业化层面，百度和今日头条的竞争非常激烈，百度把搜索结果更多指向自家平台的意图也很明显。《搜索引擎百度已死》一文亦指出，百度已经不打算好好做一个搜索引擎了，它只想做一个营销号平台，把希望来搜索内容的人全都变为自家的流量，然后变现。'    
f(p)
